{
  "vakken":[
    {
      "id": 0,
      "title": "PTM",
      "opdrachten" :[

      ]
    },
    {
      "id": 1,
      "title": "UEX",
      "opdrachten": [
        {
          "id": 0,
          "image": "images/ucd.jpg",
          "title": "User Centered Design",
          "subtitle" : "De 5 'stages' van User Centered Design",
          "description": "Bij het onderzoek naar user centered design heb ik de 5 stappen “stages” hiervan bekeken. Door hiernaar onderzoek te doen heb ik een beter beeld gekregen bij wat user centered design is en hoe dit kan worden toegepast.<br><br> Hieronder het onderzoek naar User Centered Design:<br> <embed class='pdfembed' src='files/ucd.pdf'> "
        },
        {
          "id": 1,
          "image": "images/interview.jpg",
          "title": "Interview",
          "subtitle": "Onderzoek naar een doelgroep",
          "description": "Dit is een beschrijving"
        },
        {
          "id": 2,
          "image": "images/storyboarding.jpg",
          "title": "Storyboarding",
          "subtitle": "Het maken van een storyboard voor een artiest",
          "description": "Vervolgens ben ik begonnen aan het maken van een storyboard. Eerst heb ik een lijst gemaakt van stappen die het storyboard gaat doorlopen en vervolgens heb ik in Adobe Illustrator de eerste versie van mijn storyboard gemaakt. <br><br> De eerste versie is hieronder te zien:<br> <img src='images/storyboard.jpg' alt='De eerste versie van het storyboard' class='flexpocimg'><br> Hierna heb ik de les feedback gekregen op mijn storyboard in de les. Ik heb geleerd dat je in een storyboard zo min mogelijk tekst moet gebruiken en het verhaal zo goed mogelijk met duidelijke beelden moet overbrengen.<br><br>Vervolgens heb ik mijn storyboard op deze feedback aangepast. De 2e versie is hieronder te zien:<br><img src='images/storyboard2.png' alt='De tweede versie van het storyboard' class='flexpocimg'><br>Bij deze verie heb ik er voor gekozen een groot deel van de tekst weg te halen. De tekst in het eerste plaatje heb ik vervangen door alleen het logo, op deze manier beeld het nog steeds hetzelfde uit maar is er minder tekst. Ook heb ik het 3e en 4e plaatje samengevoegd aangezien deze los overbodig waren en ook prima samen konden in een afbeelding. Verder heb ik ook het einde veranderd en het bestellen van tickets nog maar op een afbeelding laten zien.<br><br> Bij deze opdracht heb ik geleerd hoe ik een storyboard moet maken en welke elementen hierin belangrijk zijn en welke dingen beter niet in een storyboard kunnen staan. Zo moet in een storyboard een duidelijk verhaal zo simpel mogelijk worden overgebracht zodat de boodschap duidelijk zonder dat de lezer veel moeite moet doen om het storyboard te begrijpen."
        },
        {
          "id": 3,
          "image": "images/task.jpg",
          "title": "Task Analysis",
          "subtitle": "Onderzoek naar wensen gebruikers",
          "description": "In de eerste week van sprint 1 ben ik voor UX bezig geweest met het maken van de Task Analysis. Hiervoor hebben we eerst individueel 5 sticky notes gemaakt met daarop 5 verschillende beschrijvingen zoals aangegeven in de opdracht ('As a ... (type of user) I want to ... (perform a task), such that ...(goal).'). <br><br> Vervolgens hebben we van iedereen deze sticky notes samengevoegd om zo de beste 5 uit te zoeken. We hebben dit gedaan door te kijken naar welke sticky notes op dit moment het belangrijkste zijn voor Mick en waar zijn publiek het meeste aan heeft. Zo hebben we gekozen voor een goed logo en een unieke huisstijl aangezien Mick deze nog niet heeft. Ook het bekender maken van zijn muziek vonden we op dit moment belangrijk aangezien Mick op het moment nog niet heel erg bekend is.<br> <img src='images/taskanalysis.png' alt='De uitgevoerde task analysis' class='flexpocimg'><br> Door het maken van deze opdracht denk ik dat ik en dat wij als groep en beter beeld krijgen van de behoefte van verschillende gebruikers van ons product (in dit geval vooral de artiest maar ook de fans die met het merk interactie hebben). Door een task analysis uit te voeren krijg je inzicht in welke behoefte een artiest heeft voor zijn brand en hoe de fans en luisteraars met het merk om willen gaan. <br><br> Ik heb geleerd hoe ik een task analysis kan uitvoeren voor een brand en hoe ik door het maken van een task analysis erachter kan komen welke producten of onderzoeken belangrijk zijn voor de ontwikkeling van een brand en hoe de gebruiker hiermee in aanraking komt zodat er een goede en fijna gebruikservaring gecreëerd wordt."
        },
        {
          "id": 4,
          "image": "images/cards.jpg",
          "title": "Card Sorting",
          "subtitle": "Het belang van een duidelijke UI",
          "description": "Bij de card sorting opdracht hebben we als groep voor Marktplaats als website gekozen. We zijn op de site gaan kijken naar welke producten er te koop zijn en hebben vervolgens een aantal dingen op briefjes geschreven. Vervolgens hebben we eerst zelf deze briefjes bij elkaar gelegd zodat ze volgens ons logische categorieën vormden.<br><br> <i>De briefjes door elkaar:</i><br> <img src='images/cardsorting2.png' alt='Alle gemaakte kaarten' class='flexpocimg'><br> Vervolgens hebben we aan mensen buiten onze groep gevraagd om de briefjes te verdelen in categorieën en deze vervolgens een naam te geven. Dit kwam daar uit:<br> <img src='images/cardsorting1.png' alt='De gesorteerde kaarten' class='flexpocimg'><br> We hebben het sorteren van onszelf vergeleken met die van anderen en zijn er zo achter gekomen dat er tussen personen toch bij een aantal categorieën en voorwerpen een ander resultaat uitkomt. Zo blijkt dat niet iedereen dezelfde voorwerpen bij dezelfde categorie ingedeeld en ook niet alle categorieën dezelfde naam / beschrijving geeft.<br><br> Hiervan heb ik geleerd dat het als maker van een applicatie of een website nog best wel lastig en een uitdaging kan zijn om een goede en voor iedereen duidelijk interface / verdeling te maken aangezien iedereen deze anders interpreteert.<br><br> Om een goed ontwerp te kunnen maken lijkt het mij dus van belang dat je van te voren goed onderzoek doet naar het gedrag en de interpretatie van de gebruiker. Card sorting lijkt me, voor het maken van categorieën voor een app of website een goede manier om dit te doen. Door dezelfde kaarten aan een grote groep mensen voor te leggen kan je de meest voorkomende combinaties en namen voor een categorie gebruiken zodat je systeem voor het grootste deel van de gebruikers goed te volgen is.<br><br> Deze test is een van de 3 tests die ik in dit semester heb uitgevoerd voor leerdoel 3.B. voor UX. Het doel van deze test was om een inzicht te krijgen in welke categorieën we producten op een website kunnen onderverdelen zodat de producten voor de gebruiker makkelijk te vinden zijn. Het voordeel van dit doel op deze manier testen is dat de gebruiker zelf de catergorieën kan bepalen of de producten zelf in een categorie indeeld. Op deze manier krijg je een beter inzicht in hoe mensen producten verdelen. Door dit met meerdere mensen te doen kun je patronen in het sorteren ontdekken en door vervolgens je prodocuten  op deze manier in te delen zal het voor de meeste mensen goed vindbaar zijn. Het nadeel van deze test is dat mensen vaak onderdelen verschillend indelen waardoor je veel reacties nodig hebt om een trend te vinden waarbij de meeste mensen de producten indelen. Bij een aantal producten zal veelal hetzelfde antwoord naar boven komen maar bij lastiger in te delen producten kan het zijn dat er veel verschillende antwoorden uit komen, al helemaal als de persoon zelf categorieën kan verzinnen. Hierdoor kan het alsnog lastig zijn deze producten onder te verdelen terwijl je voor deze producten juist een duidelijke categorie nodig hebt. <br> Dit geldt ook voor onze test die we hebben uitgevoerd. Zo bleek dat de makkelijk te vinden producten zoals telefoons, computers en schoenen vaak in dezelfde categorieën terecht kwamen maar de producten die lastiger te plaatsen vallen, in totaal verschillende categorieën geplaatst worden waardoor er voor deze producten niet echt een zekere uitkomst kan worden gegeven."
        },
        {
          "id": 5,
          "image": "images/paperprototype.jpg",
          "title": "Paper Prototyping",
          "subtitle": "Prototyping Pt.1",
          "description": "Voor de eerste prototyping opdracht hebben we als proftaak een paper prototype gemaakt voor een eerste ontwerp van onze website voor onze artiest. We hebben eerst een ontwerp gemaakt en dit op papier als wireframe getekend. Dit hebben we gedaan voor de belangrijkste pagina's van de site dit zijn onder andere: de landingpage, de muziekpagina, de webshop en de pagina met concerten. Vervolgens hebben we alle menuelementen toegevoegd en de paper prototype in elkaar gezet. <br><br> Na het maken van de paper prototype hebben we het prototype getest door iemand met het prototype te vragen om naar een bepaalde pagina te navigeren en vervolgens te kijken of de navigatiestructuur duidelijk is.<br><br> <i> Hieronder is een filmpje van de uitvoering van de test te zien: </i><br><div style='margin:auto; width:75%;'> <embed class='videoembed' src='files/paperprototype.mp4'></div><br> Door het maken van deze opdracht heb ik geleerd wat het nut kan zijn van het maken van een paper prototype. Ook heb ik geleerd dat het belangrijk is dat je niet alleen een prototype binnen je eigen groep maakt maar deze ook door andere mensen laat testen. Op deze manier kom je erachter of de door jou gekozen manier voor het oplossen van een probleem of voor het maken van een menustructuur of een user interface ook voor de eindgebruiker duidelijk te begrijpen en te gebruiken is. Ik heb geleerd wanneer het handig kan zijn om een paper prototype te maken om iets te testen. Dit kan handig zijn in het begin van een ontwerpproces van een applicatie of website om de eerst gemaakte versie van een wireframe te testen op gebruiksvriendelijkheid. Doordat een paper prototype makkelijk en snel te maken is, is dit een prima manier van prototypen om te gebruiken in een vroeger stadium van een ontwerpproces. <br><br> Voor onze proftaak heeft deze opdracht ons inzicht gegeven in de manier waarop wij onze navigatiestructuur op onze website kunnen inrichten. Dit heeft toepassing op de keuze voor waar de verschillende menu's en knoppen op de pagina komen te staan en hoe de verschillende pagina's met elkaar linken om een zo goed mogelijke gebruikerservaring te creëren. <br><br>"
        },
        {
          "id": 6,
          "image": "images/fysiekprototype.jpg",
          "title": "Fysiek Prototype",
          "subtitle": "Prototyping Pt.2",
          "description": "Dit is een beschrijving"
        },
        {
          "id": 7,
          "image" : "images/technischprototype",
          "title": "Technisch Prototype",
          "subtitle" : "Prototyping Pt.3",
          "description": "yeet"
        },
        {
          "id": 8,
          "image": "images/"
        }
      ]
    },
    {
      "id": 2,
      "title": "SCO",
      "opdrachten":[
        {
          "id": 0,
          "image": "images/visual.jpg",
          "title": "Visual Associations",
          "subtitle": "Vinden van beeldassociaties",
          "description": "In deze week ben ik bezig geweest met het zoeken naar beeldassociaties. Ik heb hierdoor geleerd wat beeldassociaties zijn en heb deze vervolgens verzameld in een document.<br><br> <i>Een aantal voorbeelden:</i> <img src='images/visualvb.png' alt='Voorbeelden' class='flexpocimg'>Bij het maken ben ik veel gaan zoeken op Google afbeeldingen en op Pinterest naar afbeeldingen die ik cool vond. Vervolgens ben ik gaan zoeken naar afbeeldingen die hierbij pasten. Dit bleek lastiger dan ik eerst dacht maar ik vind dat dit vooral bij het 2e, 3e en vierde voorbeeld goed gelukt omdat hiet de vorm en de lijnen in beide afbeeldingen goed overeenkomen en de associatie duidelijk te zien is. Bij het 1e voorbeeld heb ik vooral gekeken naar kleur en compositie en ik vind dit iets minder goed gelukt aangezien dit wellicht niet meteen te zien is.<br><br> Door het maken van deze opdracht heb ik een beter beeld gekregen bij wat beeldassociaties zijn en hoe je door te kijken naar 2 afbeeldingen deze kan matchen op een aantal aspecten zoals kleur, compositie, lijnenspel en vorm.<br><br>Bij het maken van de Visual Associations heb ik voorbeelden gebruikt die ik op internet heb gezocht, door dit te doen heb ik inspiratie gekregen voor het maken van de beeldassociaties. Door hier feedback op te vragen heb ik een aantal beeldassociaties aangepast en heb ik er nog een toegevoegd. Door dit te doen ben ik beter geworden in het zoeken van voorbeelden en het gebruiken van inspiratie om iets te maken dat ik nog niet eerder heb gemaakt. Door te itereren hierop en feedback te vragen heb ik verbeteringen kunnen maken en toevoegingen kunnen doen.<br><br><a href='files/visual.pdf' target='blank'><button class='pocButton'>Alle beeldassociaties</button></a>"
        },
        {
          "id": 1,
          "image": "images/fotografie.jpg",
          "title": "Fotografie",
          "subtitle": "Foto's van architectuur op TU/e",
          "description": "In week 2 ben ik met SCO vooral bezig geweest met fotografie. Na een korte uitleg over de spiegelreflexcamera ben ik op het TU/e terrein foto’s gaan maken van architectuur. Ik heb vele foto’s gemaakt van verschillende gebouwen vanuit verschillende perspectieven. <br><br> Vervolgens heb ik de foto’s op mijn laptop gezet en deze bewerkt in Adobe Photoshop. Een aantal voorbeelden zijn hieronder te zien:<br><img src='images/tuFotos.png' alt='Foto's TU/e' class='flexpocimg'>De eerste en de vierde foto vind ik goed gelukt omdat beide foto's de gekozen gebouwen centraal in de foto staan en goed naar voren komen. Dit vind ik in de eerste foto iets beter als in de vierde foto. Op de eerste foto heb ik echter wel meer moeten bewerken aangezien ik hier gedeeltelijk tegenlicht had bij het maken van de foto. Bij de derde foto vind ik het ook goed gelukt om de grootte van het gebouw weer te geven ookal staat het gebouw in deze foto er niet compleet op maar loopt het van links naar het einde rechts.<br><br> De tweede foto vind ik zelf ook erg goed gelukt. Ik heb er hier voor gekozen om niet een heel gebouw te fotograferen maar een klein deel ervan. Vervolgens heb ik naar een goed perspectief gezocht om de reflectie in de ramen van het gebouw te gebruiken om een goede foto te maken. Ik denk dat dit goed is gelukt aangezien de rechterkant precies is gespiegeld in het raam.<br><br><br><br>In totaal heb ik meer dan 90 foto's gemaakt op het TU/e terrein en van deze foto's heb ik er 15 uitgekozen en bewerkt. Ik heb van elk gebouw meerdere foto's gemaakt en vervolgens de beste uitgezocht. Dit heb ik gedaan door te kijken op welke foto het licht, de focus en de positie het beste waren.<br> Hieronder staan een aantal foto's die ik heb gemaakt waaruit ik vervolgens de beste heb gekozen.<br><img src='images/keuzefoto1.png' alt='Foto's die ik heb gemaakt' class='flexpocimg'>De bovenstaande foto's zijn allemaal van hetzelfde gebouw. Van al deze foto's heb ik uiteindelijk de foto rechtsboven gekozen en bewerkt. Ik vond het idee dat ik had voor de foto, symmetrie maken door het spiegelen in de ramen het beste gelukt.<br>Bij de twee foto's links- en rechtsonder staat er links net een paal voor de lens waardoor het effect van de foto minder wordt.<br>Bij de foto rechtsboven is de afstand tussen de camera en het raam te groot waardoor het effect bijna niet te zien is.<br>In de middelste foto is de foto te ver van de raam af genomen en is daardoor de weespiegeling niet duidelijk te zien. Bovendien zijn hier de rolluiken in de ramen te zien die je in de gekozen foto niet kan zien.<br><br> Door naar al deze dingen voor compositie maar ook naar licht te kijken heb ik al mijn foto's gekozen.<br><br><img src='images/keuzefoto2.png' alt='Foto's die ik heb gemaakt' class='flexpocimg'>Bij de bovenstaande foto's heb ik ook voor de foto rechtsboven gekozen omdat op deze foto het gebouw goed te zien is en goed belicht is. Ook vind ik het contrast met de achtergrond goed ookal is de achtergrond wel aan de lichte kant. <br>Bij de foto rechtsonder is er veel te veel licht op de achtergrond waardoor vooral de bovenkant van het gebouw wegvalt en veel te licht is in verhouding met de rest van het gebouw.<br> Bij de foto linksonder is het gebouw juist veel te donker en is het contrast klein waardoor de onderkant van het gebouw erg slecht te zien.<br> Bij de laatste foto linksboven is eigenlijk hetzelfde aan de hand als bij de foto rechtsonder, de helderheid is veel te hoog en achtergrond is heel erg licht waardoor de bovenkant van het gebouw bijna niet meer contrasteert met de achtergrond.<br><br><br><a href='files/fotos.pdf' target='blank'><button class='pocButton'>Alle bewerkte foto's</button></a><br> <b> Conclusie </b> <br> Door het maken van deze opdracht heb ik een beter inzicht in fotografie gekregen. Door foto's te gaan maken met verschillende instellingen op de camera en deze vervolgens te vergelijken heb ik een beter beeld gekregen in hoe diafragma, sluitertijd en iso werken en hoe ik deze kan aanpassen om een beter foto te maken. Ook heb ik door foto's van gebouwen te moeten maken nagedacht over compositie en hoe ik de gebouwen op een goede manier kan fotograferen.<br><br> Vervolgens heb ik door mijn foto's te bekijken en te bewerken kunnen zien welke effecten verschillende instellingen op de camera hebben gehad op mijn foto's en door 'goede' foto's uit te kiezen kunnen zien wat er minder goed was aan andere foto's en hoe dit verbeterd kan worden door andere instellingen te gebruiken of door een andere positie te kiezen. <br><br> Door van te voren naar voorbeelden van architectuurfotografie te zoeken heb ik tijdens het maken van de foto's nieuwe ideëen voor foto's kreeg. Vervolgens heb ik een paar van deze foto's proberen na te maken of het effect proberen na te maken in de post-productie. Door dit te doen ben ik beter geworden in het gebruiken van voorbeelden en heb ik meer geleerd over fotografie en hoe ik beter foto's van architectuur kan maken."
        },
        {
          "id": 2,
          "image": "images/typografie.jpg",
          "title": "Typografie",
          "subtitle": "Posters maken met Typografie",
          "description": "Voor Concepting ben ik bezig geweest met het maken van posters waarin gebruik wordt gemaakt van typografie. Ik heb op DaFont, Fontsquirrel en Adobe Typekit gezocht naar interessante / unieke fonts om mee te werken en ben vervolgens op Pinterest gaan zoeken naar inspiratie voor op typografie gebaseerde posters. <br><br> <i>Een paar voorbeelden van gevonden posters:</i><br> <img src='images/voorbeeldposters.jpg' alt='voorbeeldposters.' class='flexpocimg'><br> Van het eerste voorbeeld vond ik het vooral cool dat de lijnen van de rechte letters gebruikt zijn om de ruimte tussen de tekst te vullen door deze door te trekken en te gebruiken om verschillende vormen te maken.<br> Bij het tweede voorbeeld vind ik dat het in elkaar plaatsen van de letters een leuk effect geeft wat er leuk uitziet. Omdat alle letters met verschillende groottes in elkaar passen en zo het hele canvas ziet het er erg leuk bedacht uit.<br> Bij het derde voorbeeld vind ik vooral het idee om gebruik te maken van letters om een vorm te creëren een leuk idee. Ook al is in deze poster slechts van een steeds herhalende vorm gebruik gemaakt, vind ik het idee om letters te gebruiken om een vorm te maken een leuk idee. <br><br> Vervolgens ben ik met gedownloade lettertypes gaan experimenteren in Adobe Illustrator en heb ik zelf een aantal posters gemaakt.<br><br> <i>3 poster gemaakt naar aanleiding van de bovenstaande 3 voorbeelden:</i><br> <img src='images/gemaakteposters.jpg' alt='gemaakteposters.' class='flexpocimg'><br> Bij de eerste poster heb ik, net als ik het voorbeeld, geprobeerd om de lijnen van de rechte letters door te trekken en deze te gebruiken om met extra lijnen de ruimte tussen de tekst op te vullen. Ik vind deze poster, gebaseerd op het voorbeeld, redelijk goed gelukt aangezien ik het het hele lege stuk om de tekst redelijk goed heb kunnen vullen. Ik had achteraf wat minder lange lijnen willen gebruiken en meer korte lijnen willen gebruiken om zo meer textuur te creëren net als in het voorbeeld.<br><br> De tweede poster vind ik iets minder goed gelukt. Dit komt mede doordat het me niet overal is gelukt om alle letters even makkelijk in elkaar te schuiven, waardoor er op sommige plekken nog lege stukken te zien zijn. Ik heb voor het maken van deze poster verschillende fonts getest en uiteindelijk is het met dit cartoon-achtige font redelijk goed gelukt omdat de letters allemaal redelijk dezelfde vorm aanhouden en omdat de hoeken van de letters allemaal redelijk rond en de letters zelf redelijk recht zijn.<br><br> Bij de derde poster heb ik voor een erg rond font gekozen waarin alle letters met rondingen zijn gemaakt. Vervolgens heb ik een aantal letters op het canvas gezet en ben ik deze aan de uiteinden aan elkaar gaan verbinden om zo een grote vorm te maken. Uiteindelijk was het best lastig om de letters zo neer te zetten zodat ze en goed met elkaar verbonden waren en dat ze allemaal op het canvas pasten zonder dat ze door elkaar heen stonden. Ik ben uiteindelijk wel blij met het resultaat en denk dat het vooraf bedachte idee goed gelukt is.<br><br> Ik vond dit een leuke opdracht om te maken en ik ben hier ook mede daardoor best lang mee bezig geweest. Ik vond het leuk om door alleen letters te gebruiken vorm te geven aan een poster en heb hierdoor geleerd hoe ik typografie kan gebruiken om iets vorm te geven, hoe ik fonts op andere manieren dan alleen tekst kan gebruiken en hoe ik een canvas voor bijvoorbeeld een poster goed kan indelen.<br><br><a href='files/posters.pdf' target='blank'><button class='pocButton'>Alle posters</button></a>"
        },
        {
          "id": 3,
          "image": "images/logos.png",
          "title": "Logo Design",
          "subtitle": "Logo ontwerp voor een artiest",
          "description": "Voor het maken van een brand guide moest er een logo voor Mick worden gemaakt. Aangezien mij dit erg leuk leek om te doen heb ik het grootste deel hiervan kunnen doen.<br><br> Als eerste ben ik gaan zoeken op internet van voorbeeldlogo's van bands en muziek in dezelfde stijl en hetzelfde genre als waar we mick neer willen zetten. Ik ben er toen achter gekomen dat ik het in het begin best lastig vond om van inspiratie een logo te maken. Toen heb ik besloten eerst te kijken naar wat ik met de naam 'Mick Stender' kon doen in typografisch opzicht en heb ik een aantal eerste logo's gemaakt. Vervolgens ben ik gaan kijken naar het gebruik van de oude 'vintage' microfoon van Mick. Ik heb naar voorbeelden gezocht via Google en Pinterest en heb vervolgesn met een icoon van een microfoon weer een aantal logo variaties gemaakt. Deze heb ik vervolgens iets verder uitgewerkt en ik heb een aantal nieuwe variaties toegevoegd. Na feedback op logo's te hebben gekregen en de meeste logo's te druk waren en aangezien Mick het zelf graag simpel wilde houden heb ik samen met mijn groep weer een aantal logo's gemaakt. Hiervan hebben we er uiteindelijk 2 gekozen om als primair en secundair logo te gebruiken. Tijdens dit hele proces heb ik tussendoor feedback gevraagd binnen mijn groep en op basis hiervan geprobeerd nieuwe en aangepaste versies van mijn logo's te maken.<br><br> <i>Hieronder staat een groot deel van de gemaakte logo's:</i><br></p> <div style='margin:auto; width:80%;'> <img src='images/logodesign.png' alt='Een groot aantal gemaakte logo's' width='100%'> </div><br><br> <p> Uiteindelijk hebben we er als groep voor gekozen om de onderstaande 2 logo's te gaan gebruiken als primair en secundair logo. We hebben hiervoor gekozen omdat de logo's niet te druk zijn en de naam van Mick het eerste is wat eruit springt. We hebben ook gebruik gemaakt van het lettertype 'Lemon Milk' wat Mick erg cool vond nadat hij het had gezien in onze Artistic Exploration. </p><div style='margin:auto; width:80%;'> <img src='images/micklogos.png' alt='Een groot aantal gemaakte logo's' width='100%'> </div> <p> Door het maken van deze logo's heb ik een beter inzicht gekregen in hoe het proces voor het ontwerpen van een logo werkt. Ik vind dat het ontwerpproces redelijk goed is gegaan. Ik vond het in het begin lastig om inspiratie op te doen voor een ontwerp te maken maar dit is uiteindelijk wel gelukt en toen ik met het ontwerpen bezig was kwamen er van zelf nieuwe ideëen voor logo's naar boven. Uiteindelijk ben ik tevreden met het proces en denk ik dat ik veel geleerd heb over het ontwerpen van logo's door het zelf te doen maar ook door te zoeken naar inspiratie op YouTube, Pinterest en Dribble. <br><br> Tijdens het ontwerpproces heb ik constant interaties van mijn logo's gemaakt en heb ik van sommige logo's veel verschillende varianten gemaakt. Door gebruik te maken van professionele voorbeelden en constant te blijven ittereren heb ik nieuwe mediaproducten gemaakt die ik eerder nog niet gemaakt had. Ik heb geleerd hoe ik vanuit inspiratie en voor een bepaalde stijl een logo kan ontwerpen en dat het belangrijk is om meerdere versies van een logo te maken zodat je de opdrachtgever, in dit geval de artiest, een keuze kan geven over welk soort logo hij het beste vind passen. Door vervolgens te itereren heb ik de eerste versies van de logo's verbeterd op basis van de gekregen feedback waardoor ik hier ook beter in ben geworden. Door veel voorbeelden te gebruiken en verschillende stijlen en uit te proberen heb ik meer geleerd over de basis van logo design en hoe ik dit kan gebruiken om de stijl van in dit geval een artiest weer te geven. <br><br><i>Mijn Illustrator artboards:</i></p><div style='margin:auto; width:95%;'> <img src='images/logoArtboard.png' alt='Een groot aantal gemaakte logo's' width='100%'> </div>"
        },
        {
          "id": 4,
          "image": "images/brandvalue.jpg",
          "title": "Brand Value",
          "subtitle":"Business Canvas Model",
          "description": "In sprint 2 ben ik samen met mijn groep voor strategy bezig geweest met de brand value voor onze proftaak. Hiervoor hebben we in onze proftaakgroep een Business model canvas voor onze artiest ingevuld. We hebben eerst gekeken naar de huidige situatie van onze artiest en hiervoor de canvas ingevuld.<br><br> <i>Het business model canvas voor de huidige situatie van onze artiest:</i><br><img src='images/bmc1.png' alt='Business model canvas voor de huidige situatie.' class='flexpocimg50'><br>We hebben eerst de onderdelen van het BMC opgeschreven met whiteboardmarker, en hebben vervolgens stickynotes geplakt per onderdeel van het BMC. Dit is 2x uitgevoerd: de eerste keer om de huidige status van Mick Stender samen te vatten, en de tweede keer om de toekomstige status in kaart te brengen. Door een Brand Model Canvas te maken krijg je een soort samenvatting van de huidige status van een ‘merk’ (in dit geval: een artiest). <br><br> Na het invullen van de huidige situatie hebben we een nieuw canvas ingevuld voor onze artiest voor waar wij hem over een aantal jaar zien.<br><br> <i>Het business model canvas voor de toekomstige situatie:</i><br> <img src='images/bmc2.png' alt='Business model canvas voor de huidige situatie.' class='flexpocimg50'><br>In deze BMC hebben we de toekomstige (+/- 3 jaar) situatie van Mick samengevat. Hier vallen direct enkele dingen op: er zijn dubbel het aantal channels toegevoegd, het aantal revenue streams is vervijfvoudigd (van één naar vijf, vanwege meer bedrijfs interesse in het maken van sponsorships en merch), en er is sprake van een professioneel label en manager.<br><br>Door deze analyse van onze brand te doen hebben we een beter beeld gekregen over hoe we Mick verder kunnen helpen met een strategie. Zo zijn we erachter gekomen dat we ervoor willen zorgen dat Mick zijn muziek ook op spotify zet zodat hij een breder publiek kan bereiken. Aangezien Mick momenteen alleen Facebook`gebruikt en pas net is begonnen met zijn Instagram account zouden wij hem ook willen aanraden om Instagram te blijven gebruiken om een jongere doelgroep te bereiken. Daarnaast zijn we ook bezig geweest met het maken van een Snapchat filter om te gebruiken op stickers voor bij festivals. Op deze manier raken mensen, vooral jongeren, ook bekend met Mick en breiden we zijn bekendheid uit. Door de huidige situatie te analyseren en deze te vergelijken met een ideale situatie over een aantal jaar hebben we deze adviezen/ kunnen geven.<br><br> Door na te denken over de huidige situatie van onze artiest en vervolgens vooral te gaan kijken naar hoe wij hem in de toekomst zien lijkt mij een handige manier om de stappen die moeten worden gezet om bij deze situatie te komen te visualiseren. Ik heb bij deze opdracht geleerd goed na te denken over wat er allemaal om een brand heen draait en welke dingen een belangrijke rol spelen in de waarde en de opbouw van een brand. Deze manier van analyseren is vooral handig geweest om een algemeen idee te krijgen voor de opbouw van de strategie. We hebben een inzicht gekregen in welke media er gebruikt moeten gaan worden en aan welke gebieden de meeste aandacht moet worden besteed. Op basis van het maken van deze opdracht kunnen we vervogens een strategie ontwikkelen waarin staat beschreven hoe de ideale situatie kan worden gebruikt en welke stappen hiervoor moeten worden gezet.<br> "
        },
        {
          "id": 5,
          "image": "images/magazine.png",
          "title" : "Magazine Page Layout",
          "subtitle" : "Magazine Design",
          "description": "Voor het maken van twee pagina's van een magazine ben ik eerst gaan zoeken naar een artikel over onze artiest. Vervolgens heb ik een artikel gekozen dat een goede hoeveelheid tekst had om 2 pagina's te kunnen vullen. <br> Vervolgens heb ik gekeken op internet naar verschillende soorten grid-layouts voor een magazine. Ik heb voorbeelden gezocht op Pinterest en Google om te kijken naar hoe een magazine normaal is opgebouwd. Hierna ben ik in InDesign zelf een grid gaan maken en heb deze vervolgens uitgewerkt naar een eindproduct. <br><br> Hiervoor heb ik eerst een lay-out gemaakt voor hoe de pagina is opgedeeld. Dit heb ik gedaan door vakken op de pagina te zetten en deze vervolgens een doel te geven (content, titel, inleiding). Vervolgens heb ik de tekst van het artikel toegevoegd aan de lay-out en heb ik de lege plekken die overbleven gevuld met nieuwe vakken voor foto's en quote's. Hierna heb ik foto's van onze artiest gezocht en deze hierin gezet. Hierna heb ik de pagina opgemaakt in de stijl van onze Brandguide. De 4 hierboven beschreven versies zijn hieronder te zien. <br><br> <div style='margin:auto; width:95%;'> <img src='images/magazineDesign.png' alt='De lay-out voor het magazine' width='100%'></div><br><br>Ik heb vervolgens nog een paar variaties op gemaakt op de laatste pagina om een paar dingen te porberen die er voor konden zorgen dat de pagina er iets interessanter/ beter uit zag. Deze variaties zijn hier onder te zien. <br><br> <div style='margin:auto; width:95%;'> <img src='images/magazineDesign2.png' alt='De lay-out voor het magazine' width='100%'><br><br> Door het maken van deze pagina lay out heb ik geleerd wat het magazine grid systeem is en hoe ik dit kan gebruiken om een magazine pagina in te delen. Door gebruik te maken van een bestaand artikel in plaats van willekeurige tekst heb ik bij het maken van mijn grid moeten nadenken over de hoeveelheid tekst die ik moest gebruiken en hoe ik de lege ruimte hiertussen kan gebruiken om beide pagina's te kunnen vullen. Bij het maken van mijn ontwerp heb ik ook inspiratie opgedaan uit voorbeelden van bestaande magazines of naar ontwerpen door anderen via Pinterest en Dribble gekeken. Hierdoor heb ik een goed beeld kunnen krijgen bij de indeling van een magazine en hoe het grid systeem gebruikt kan worden om een pagina vorm te geven. <br><br> Door bij het maken van de pagina's te itereren en elke versie verder uit te werken heb ik achteraf een goed inzicht gekregen in mijn ontwerpproces. Ik kan nu de laatste versie koppelen aan mijn eerste grid-design en kan bij elke versie duidelijk zien welke aanpassingen ik heb gedaan. Door ook op het laatste ontwerp een aantal variaties te maken heb ik uiteindelijk meer keuze en kan ik deze verschillende ontwerpen met elkaar vergelijken om zo een goed eindproduct te kiezen.<br><br><a href='files/magazine.pdf' target='blank'><button class='pocButton'>Alle versies/ iteraries</button></a>"
        },
        {
          "id": 6,
          "image": "images/brandguide.png",
          "title": "Brand Style Guide",
          "subtitle": "Branguide Mick Stender",
          "description" : "Het maken van de brandguide is opgedeeld in verschillende onderdelen. We hebben van te voren gekeken naar bestaande brand-guides en we hebben op basis hiervan een inhoud voor onze eigen brandguide samengesteld. Vervolgens hebben we onderdelen van de brand guide verdeeld in de groep. Uiteindelijk is dit samengekomen in de eerste versie van de brandguide. <br><br> De brandguide bestaat uit een korte omschrijving van Mick, het logo, de kleuren, de typografie, fotografie en een aantal voorbeelden. Zelf ben ik bezig geweest met het maken van het logo, de typografie en met de voorbeeldposter. <br><br> Voor het maken van de brandguide hebben we veel onderzoek gedaan naar de stijl van onze artiest en hoe wij hem in die stijl wilde neerzetten. We hebben onderzoek gedaan naar typografie, fotografie en logo-design en deze apart uitgewerkt. Vervolgens hebben we voor al deze onderdelen ontwerpen gemaakt en deze met elkaar vergeleken. Door constant met elkaar te blijven overleggen en te vergelijken hebben we ervoor gezorgd dat de stijl hetzelfde bleef en er geen afwijkingen waren tussen bijvoorbeeld logo en typografie.We hebben deze versie van de brandguide gepresenteerd aan het einde van sprint 1 aan BR-ND en de rest van de groep en leraren. We hebben hierop feedback gekregen en deze feedback hebben we hierna verwerkt in de tweede versie van de brandguide. <br><br> Vervolgens hebben we dit porces herhaald bij het maken van de volgende versies van de brandguide. We hebben op basis van de gekregen feedback nieuw onderzoek gedaan en delen van de brandguide aangepast en toegevoegd. Ook nu hebben we ervoor gezorgd dat de stijl binnen de brandguide en de mediavoorbeelden overal hetzelfde is.<br><br> Uiteindelijk hebben we verschillende iteraties van onze brandguide gemaakt waarin steeds toevoegingen en aanpassingen werden gedaan om uiteindelijk tot een zo compleet mogelijke brandguide te komen waarin een stijl wordt gebruikt die in alle onderdelen terug te vinden is.<br><br><i> De laatste versie van de brandguide:</i><br> <div class='brandguide'> <embed class='pdfembed' src='files/brandguideFinal.pdf'><br><br>Van het maken van de brandguide heb ik veel geleerd over hoe een brandguide in elkaar zit en ook over de onderdelen van de brandguide heb ik veel nieuwe dingen geleerd. Zo heb ik geleerd dat vooral de merkessentie aan het begin van de brandguide erg belangrijk is aangezien je hier al je keuzes mee kan onderbouwen. Ook heb ik een beter inzicht gekregen in hoe je een brandguide opzet en welke onderdelen belangrijk zijn. Zo is het gebruikelijk dat het logo als eerste wordt getoond aangezien dit het 'main item' van een brand is. Ook is het belangrijk om alle onderdelen van je brandguide samen te laten komen in een aantal voorbeelden zodat het snel duidelijk wordt hoe alle losse onderdelen samenkomen. Ook heb ik geleerd dat de brandguide op een duidelijk manier moet worden opgesteld voor de gebruiker ervan. Zo moet iemand die de brandguide gebruikt om een product te maken snel en makkelijk informatie zoals kleurencodes, logogebruik en typografiegebruik terug kunnen vinden in de brandguide.<br><br>Verder was het maken van de Brandguide een iteratief proces waarmee we zijn begonnen in sprint 1 en pas hebben afgerond in sprint 3. In deze tijd hebben we constant aanpassingen gedaan op basis van gekregen feedback van docenten, experts en van Mick zelf. In totaal hebben we in de 3 sprints 4 'eindversies' van de brandguides gemaakt. In elke versie zijn een aantal aanpassingen gemaakt om de brandguide beter en completer te maken. Door dit proces zijn we constant bezig geweest met het maken van een zo goed mogelijk en zo compleet mogelijk document voor onze artiest. <br><br> We hebben bij het maken van de Brandguide ook constant rekening moeten houden met het onderzoek dat we gedaan hebben voor onze stijl en doelgroep en de analyses hiervan. We hebben er door constant te blijven vergelijken en feedback op elkaar te geven voor gezorgd dat de inhoud van de brandguide in dezelfde stijl staat en dat het een geheel is waar alle mediavoorbeelden gebruik maken van dezelfde stijl. Dit is belangrijk omdat er door middel van de brandguide voor gezorgd moet worden dat alle producten die met de brandguide gemaakt worden dezelfde stijl moeten hebben en volgens dezelfde regels gemaakt moeten worden. Deze regels hebben we in de brandguide zo goed mogelijk proberen te beschrijven en deze hebben we zelf ook nageleefd bij het maken van de mediavoorbeelden zoals de poster, het website design en de albumcovers. </div>"
        },
        {
          "id": 7,
          "image" : "images/studiofoto.png",
          "title" :  "Studio fotografie",
          "subtitle": "Fotografie V2",
          "description": "Voor het maken van de brandguide hebben wij ervoor gekozen om voor Mick ons te richten op fotografie. Hier zijn we in sprint 1 mee begonnen, en hiermee zijn we tot sprint 3 bezig geweest. We hebben constant iteraties gemaakt en geprobeerd elke keer betere foto's te maken.<br><br> Om te beginnen hebben we een algemeen onderzoek gedaan naar studiofotografie en hebben we verschillende poses gezocht op internet. Hierna zijn we zelf de fotostudio op school ingedoken en hebben we geprobeerd een aantal poses na te maken. Ook hebben we op verschillende achtergronden foto's gemaakt om te kijken wat het effect hiervan was. De eerste paar fotosessies stonden vooral in het teken van experimenteren en van proberen goede poses voor Mick. Hieronder is een document te zien met onderzoek en voorbeeldfoto's <br> <div class='brandguide'><embed class='pdfembed' src='files/voorbeeldfotos1.pdf'></div><br> Vervolgens hebben we zelf foto's gemaakt in de studio. De onderstaande foto's zijn er een paar van de eerste fotosessies <br><div style='margin:auto; width:95%;'> <img src='images/studiofotos1.png' alt='De eerste paar studiofoto's' width='100%'></div><br> We hebben bij deze foto's op een witte en op een zwarte achtergrond gefotografeerd. Vervolgens hebben we besloten dat we beter de zwarte achtergrond konden gebruiken omdat we merkten dat deze beter naar zwart-wit foto's konden worden verwerkt. We hebben ook feedback gevraagd op deze foto's en hebben hier veel uit kunnen halen. Zo waren onze foto's vooral erg onderbelicht en vielen delen van de foto's helemaal zwart weg. <br><br> We zijn hierna in sprint 2 nog een paar keer de fotostudio ingegaan voor nieuwe foto's te maken. We hebben weer experimenten gedaan met licht en met nieuwe poses. Ook hebben we deze keer een gitaar megenomen en hiermee foto's gemaakt aangezien we Mick ook graag met gitaar op de foto wilden zetten. We hebben geprobeerd deze foto's te verbeteren waar de vorige foto's minder goed waren. Een aantal foto's zijn hier te zien:<br><div style='margin:auto; width:95%;'> <img src='images/studiofotos2.png' alt='De tweede ronde studiofoto's' width='100%'></div><br>We hebben opnieuw een paar foto's met een witte achtergrond geprobeerd en we hebben deze keer ook de gitaar gefotografeerd. Ook op deze foto's hebben we weer feedback gevraagd en sommige foto's waren nog steeds onderbelicht maar over het algemeen was de kwaliteit wel beter dan de eerste iteratie. We hebben ook met Mick de foto's besproken en met hem afspraken gemaakt over een fotosessie met hem. We hebben hiervoor eerst nog onderzoek gedaan naar andere poses en gekeken naar poses en camerastandpunten waarvan Mick nog geen studiofoto's had. Vervolgens hebben we een middag met Mick foto's gemaakt in de studio. We hebben hiervoor 3 camera's gebruikt met verschillende standpunten en we hebben ook gebruik gemaakt van verschillende lichtsterktes en van verschillende invalshoeken van het licht. Ook hebben we met verschillende instellingen op de camera foto's gemaakt. We hebben veel geporbeerd en samen met 3 camera's veel foto's gemaakt. Van deze foto's hebben we vervolgens de slechte eruit gehaald en de beste overgebleven foto's hebben we bewerkt naar zwart-wit. Een aantal voorbeelden:<br><br> <div style='margin:auto; width:95%;'> <img src='images/studiofotos3.png' alt='De studiofoto's met Mick' width='100%'></div><br> Door het maken van de studiofoto's en door het hele proces van sprint 1 tot en met sprint 3 te doorlopen en steeds nieuwe dingen te proberen en te blijven itereren op gemaakte foto's heb ik veel geleerd over studiofotografie. Vooral van lichtgebruik, poses en camerastandpunten heb ik veel geleerd en ik weet nu beter hoe ik goede foto's kan maken van een object of een persoon in een fotostudio.<br><br> We zijn gedurende de 3 sprints meerdere keren de fotostudio ingeweest en ik denk dat we elke keer de foto's van de vorige keer hebben kunnen verbeteren. Door te kijken wat er minder goed was aan de foto's van vorige sessies en vervolgens deze problemen proberen op te lossen hebben we uiteindelijk vele iteraties van de studiofotografie en hebben we Mick uiteindelijk goede foto's kunnen geven waar we als groep tevreden mee kunnen zijn."
        },
        {
          "id" :8,
          "image": "images/merkessentiehead.png",
          "title": "Merkessentie",
          "subtitle" : "Branding Strategy",
          "description": "yeet"
        }
      ]
    }
  ]
}
