{
  "POCS":[
    {
      "id": 0,
      "image": "images/css.jpg",
      "title": "CSS",
      "subtitle": "Basic CSS, Flexbox, CSS Grid & Transformations",
      "description": "<h1>Opstart en Flexbox</h1><br> In de eerste week heb ik de start gemaakt voor het vak Development. Ik gebruik als IDE Atom of Visual Studio Code.<br> Als eerste heb ik een tutorial voor CSS Flexbox gezocht en heb ik aan de hand van deze tutorial een POC gemaakt voor de basis van het gebruik van CSS Flexbox. <br><br><i> Ik heb deze tutorial gevolgd: <br><b> https://www.youtube.com/watch?v=0e02dl66PYo</b></i><br><br> In de tutorial wordt de basis van Flexbox uitgelegd en wat je allemaal met flexbox kunt doen.<br><br> Door flexbox te gebruiken in mijn CSS heb ik de text containers op de juiste plaats kunnen zetten en kan ik er ook voor zorgen dat deze containers verplaatsen en dezelfde verhouding houden als de resolutie veranderd. Zelf had ik nog nooit flexbox gebruikt dus vond ik het interessant om te leren hoe dit werkt en hoe ik dit bij het maken van een website kan gebruiken om de content op mijn pagina netjes en op de goede plaats weer te geven.<br><br> Uiteindelijk heb ik met de tutorial in een half uur het volgende met flexbox gemaakt: <img src='images/flexpoc.jpg' alt='Foto van de poc.' class='flexpocimg'><h1>Webpagina met Flexbox</h1><br><br> In de 2e week heb ik verder gewerkt aan Flexbox. Dit heb ik gedaan door een webpagina te maken waarbij ik Flexbox heb gebruikt om de layout te maken.<br> Screenshot van de gemaakte pagina:<img src='images/flexpagetop.jpg' alt='Foto van website.' class='flexpocimg'<br><br> Ik heb door het gebruik van Flexbox de header, de afbeeldingen en de content op de juiste plaats gezet. Bij het maken van de webpagina ben ik beter geworden in het gebruik van Flexbox voor het maken van de lay-out van een webpagina.<br><br> Aan de onderkant van de webpagina het ik Flexbox ook gebruikt voor de lay-out van de footer: <img src='images/flexpagebot.jpg' alt='Foto van de poc.' class='flexpocimg'><br><br> Door het gebruik van Flexbox ben ik beter geworden in het indelen van mijn webpagina’s en kan ik nu beter en makkelijker de lay-out van mijn webpagina’s vormgeven dan voorheen.<br><br><br><h1>CSS Grid & Transitions / Transformations</h1><br> In de derde week ben ik begonnen met CSS Grid. Door middel van het volgen van een tutorial op youtube heb ik de basis van CSS Grid geleerd te gebruiken om een webpagina te bouwen en vorm te geven. Door gebruik te maken van CSS-Grid kan ik nu makkelijk mijn webpagina’s indelen en elementen makkelijk verplaatsen op mijn pagina door alleen van CSS gebruik te maken. <br><br> Ook heb ik geleerd op CSS Grid te gebruiken om een website responsive te maken voor het gebruik van de website op een kleiner formaat zoals op een telefoon.<br><br> <i>Tutorial: <b>https://www.youtube.com/watch?v=HgwCeNVPlo0</b></i><br><br> Het resultaat van de tutorial is in een aantal screenshots hieronder te zien.<img src='images/gridpoc.jpg' alt='Foto van de poc.' class='flexpocimg'><br> Hierboven staat de standaard pagina op volledig formaat, gemaakt met behulp van CSS Grid.<br><br>Hieronder staat dezelfde website als hierboven, maar dan voor weergave op een kleiner formaat. De website is responsive gemaakt met CSS Grid door de onderstaande code te gebruiken bij een groot scherm en de standaardcode te gebruiken voor de mobiele weergave.<br><div style='text-align: center'><img src='images/gridpocmobile.jpg' alt='Foto van de poc.' class='gridpocimg'></div><iframe class='codeEmbed' width='100%' height='300' src='//jsfiddle.net/Robin99G/6xefdsmg/embedded/css/dark/' allowfullscreen='allowfullscreen' allowpaymentrequest frameborder='0'></iframe>Vervolgens ben ik ook bezig geweest met het maken van simpele animaties met CSS door middel van transitions en transformations met CSS. Ik heb 2 tutorials gevolgd op youtube en vervolgens 2 kleine webpagina’s gemaakt met een paar simpele transitions en transformations.<br><br><a href='/pocs/CSS_Transitions/index.html' target='blank'><button class='pocButton'>CSS Transitions</button></a><a href='/pocs/CSS_Transformations/index.html' target='blank'><button class='pocButton'>CSS Tranformations</button></a> "
    },
    {
      "id": 1,
      "image": "images/calculator.jpg",
      "title": "Basic Javascript",
      "subtitle": "De basis van Javascript",
      "description": "Bij het begin van sprint 2 ben ik begonnen met de basis van Javascript. Aangezien ik al een beetje ervaring had met javascript heb ik de basis herhaald door het maken van 2 kleine webpagina’s. Een simpele rekenmachine en een steen, papier schaar spel.<br><br> Bij het maken van deze 2 webpagina’s heb ik gebruikt gemaakt van variabelen, functies, If statements en een beetje DOM. Door dit te doen ging de basis van javascript weer wat soepeler.<br><br> Ik vond het voor mezelf fijn om deze 2 applicaties te maken omdat ik zo voor mezelf even kort kon herhalen wat ik al eerder heb geleerd. Verder heb ik ook nog een beetje verder geëxperimenteerd / geoefend met CSS door de opmaak van de pagina.<br><br> <i>De 2 gemaakte webpagina’s:</i> <img src='images/jsbasic1.png' alt='De tweede versie van het storyboard' class='flexpocimg'> <br> <img src='images/jsbasic2.png' alt='De tweede versie van het storyboard' class='flexpocimg'> <br> Bij het maken van het steen, papier, schaar spel heb ik naast het herhalen van wat ik al wist, ook geleerd hoe ik met javascript nieuwe tekst in een lege div kan zetten en deze te updaten om in dit geval aan te kunnen geven wie het spel heeft gewonnen.<br><br> Link naar de 2 pocs met de code:<br><br><a href='/pocs/calculator/index.html' target='blank'><button class='pocButton'>JS Calculator</button></a><a href='/pocs/rps/index.html' target='blank'><button class='pocButton'>Rock, Papaer, Scissors</button></a>"
    },
    {
      "id": 2,
      "image": "images/dom.jpg",
      "title": "DOM",
      "subtitle": "Using Js to change content",
      "description": "In de rest van sprint 1 ben ik bezig geweest met DOM voor Javascript. Na een uitleg in de vissenkom en wat research op W3schools heb ik een POC gemaakt waarin ik geleerd heb hoe ik stijl kan toevoegen aan een div en hoe ik div’s kan aanpassen om bijvoorbeeld tekst op het scherm te zetten of een bepaalde class of stijl aan een div kan geven. <br><br> Door het maken van deze POC heb ik een beter inzicht gekregen in hoe ik DOM kan gebruiken om met Javascript de stijl en de content van een website kan aanpassen of nieuwe content toe kan voegen of verwijderen. <br><br> In mijn gemaakte POC kun je door op de div’s te klikken de stijl / tekst laten veranderen doordat er in mijn javascript een bepaalde class aan de div wordt gekoppeld of doordat er nieuwe tekst wordt aangemaakt. <br><br><a href='/pocs/dom/index.html' target='blank'><button class='pocButton'>DOM POC + Code</button></a><br><i>Een voor- en na screenshot van mijn gemaakte POC voor het gebruik van DOM om divs stijl en/of tekst te geven:<br></i><img src='images/dombefore.jpg' alt='Foto van de poc.' class='flexpocimg'><img src='images/domafter.jpg' alt='Foto van de poc.' class='flexpocimg'> "
    },
    {
      "id" : 3,
      "image": "images/timer.png",
      "title": "Arrays & Timers",
      "subtitle" : "Changing color on a timer",
      "description" : "Dit is een beschrijving"
    },
    {
      "id": 4,
      "image": "images/git.jpg",
      "title": "Versiebeheer",
      "subtitle": "Gebruikt van Git met Github",
      "description":"Bij het maken van mijn portfolio heb ik gebruik gemaakt van versiebeheer in de vorm van Git. Aangezien ik in het vorige semeseter ook al even met Git in de vorm van GitHub heb gewerkt voor de proftaak heb ik ervoor gekozen om ook nu weer met GitHub te werken aangezien ik hier al bekend mee was en dit al set-up op mijn laptop had. <br> Om in mijn GitHub repository te werken heb ik GitKraken gebruikt als interface aangezien ik hier ook al eerder mee gewerkt had.<br><br> Vervolgens heb ik een nieuwe repository op GitHub aangemaakt en de eerste versie van mijn Portfolio geupload en vervolgens de repository op Gitkraken geopend om zo verder te werken.<br><br> Ik heb tijdens het maken van nieuwe pagina's of nieuwe delen van mijn website in een aparte branch gewerkt en zodra een nieuw deel van mijn website af was heb ik deze gemerged met de master branch waar ik altijd de laatste werkende versie van mijn portfolio in heb staan. Tijdens het werken heb ik steeds bij een aantal afgeronden aanpassingen / toevoegingen een commit gedaan via GitKraken en aan het einde van de dag of na het doen van een grotere update deze gepushed naar GitHub. <br><br> Door Git te gebruiken om mijn portfolio te maken heb ik de basis van Git geleerd en hoe ik dit kan gebruiken om een duidelijk overzicht te krijgen in hoe ik mijn portfolio heb opgebouwd. Ook weet ik nu hoe ik Git kan gebruiken om eerdere versies van mijn Portfolio terug te halen om fouten eruit te halen en dit tegelijkertijd te kunnen gebruiken als online backup. <br> <br> Hieronder staat een lijst van al mijn commits die ik heb gedaan voor het maken van mijn portfolio. Door op de beschrijving van de commit te klikken wordt er naar de GitHub pagina van de commit gelinkt. Onder de lijst staat ook nog een link naar de gehele repository op GitHub.<br><br><div style='margin:auto; width:500px; margin-top:50px;'><iframe class='gitwidget' src='http://tylerlh.github.com/github-latest-commits-widget/?username=RobinGalema&repo=Portfolio&limit=200'allowtransparency='true' frameborder='0' scrolling='yes' width='500px' height='250px'></iframe></div><br><div style='margin:auto; width:250px;'><a href='https://github.com/RobinGalema/Portfolio' target='blank'><button class='pocButton'>GitHub Repository</button></a></div>"
    }
  ]
}
